const shayaris = [
    `टूटे हुए दिल ने भी उसके लिए दुआ मांगी,<br>
     मेरी साँसों ने हर पल उसकी ख़ुशी मांगी,<br>
     न जाने कैसी थी दिल की मजबूरी,<br>
     कि मैंने खुद से पहले उसकी खुशी मांगी...`,

    `कभी किसी से दिल लगाकर देखो,<br>
     जुदाई क्या होती है समझ में आ जायेगा,<br>
     टूटकर चाहोगे जिसे तुम ज़िन्दगी से भी ज्यादा,<br>
     वही एक दिन तुम्हें तन्हा छोड़ जायेगा...`,

    `हर रात उसका इंतजार होता है,<br>
     हर पल उसको पाने का ऐतबार होता है,<br>
     दिल टूट कर रह जाता है,<br>
     जब वो कहता है मुझे तुमसे नहीं प्यार होता है...`,

    `दर्द बन कर दिल में छुपा कौन है,<br>
     रह के इस दिल में हमें रुला कौन है,<br>
     एक तरफ दिल उसे भूल नहीं पाता,<br>
     दूसरी तरफ वो जान के भी अनजान कौन है...`
];

function showRandomShayari() {
    const randomIndex = Math.floor(Math.random() * shayaris.length);
    const shayari = shayaris[randomIndex];
    document.getElementById('shayariText').innerHTML = shayari;
}
